extends Node

var geothermal_policy = """
經濟部持續發展多元綠能政策，積極投入地熱潛能探勘、
提供民間業者地熱能探勘獎勵，以加速淺層地熱開發；
針對深層地熱由國營事業(中油、台電等)帶頭，啟動深層地熱鑽探計畫，
透過國際合作等方式進行技術驗證、提升鑽井量能，
並複製成功經驗擴大設置量，加速深層地熱開發。

透過經濟部地熱推動小組研擬地熱能發電推動策略、
地熱發電單一服務窗口協助進行跨部會協調溝通等「公對公」推動機制，
在解決土地取得、原民諮商等議題下，積極推動地熱能發電，
以期加速於2027年達1 GW、2030年達到1.2GW設置目標。

經濟部不定期持續召開能源部門社會溝通會議，廣邀各界了解推動成果，
確保重點議題有效推進。依地熱推動政策方向與民間環團合作，
辦理地熱推動潛能區環社檢核。透過環社檢核機制盤點利害關係人，
進行各面向議題辨認，並進行實地訪談與意見歸納，期前研擬因應對策；
將持續滾動檢討在地溝通策略，以保障在地居民權益，加速後續案場開發。
"""

var solar_policy = """
太陽光電依相關法規排除環境敏感地區以複合利用為主，
確保光電與生態環境共存，目前已掌握所有案源，
需持續跨部會(農業部、內政部)溝通，以達2026年20GW目標

經濟部推動太陽光電以屋頂型優先，過去已三度調整屋頂型目標到8GW，
並於113年3月達成8GW目標，將持續透過法規強制與獎勵措施持續推動，
地面型則以複合式利用、不利農業經營及閒置土地，主要以複合式推動，
透過一地兩用方式維持原有土地功能加值運用，
並透過跨部會溝通合作研議具體且有效落實之機制推動，
篩選適宜設置土地，穩健達成淨零排放目標。

漁電共生於區位規劃階段即導入環社檢核機制，透過此機制進行議題辨認，
將具生態敏感性區域排除或列入關注減緩區，
以利政策推動能兼顧生態保育與在地發展，實現與環境、社會的共存共榮。
另經濟部與農業部合作漁電共生新機制，強調前期溝通共識及漁民自主參與；
後期強調分流管理，經發單位監督光電營運，
農業單位把關養殖行為，倘養殖不佳時，養殖團體可協助輔導養殖，
有效促進光電設施與漁業生產之整合，
實現「漁業結合綠能」的複合式永續利用目標。
"""
var scores_in_topics = reset_scores.duplicate(true)

const reset_scores = {
	'coast' : {'wind':{'answered':0, 'correct':0}},
	'east'	: {'geothermal':{'answered':0, 'correct':0}},
	'west'	: {'solar':{'answered':0, 'correct':0}},
}

func reset_all_scores():
	scores_in_topics = reset_scores.duplicate(true)


func get_topic_score(map_name:String, topic:String):
	return scores_in_topics[map_name][topic]


func push_score(map_name:String, topic:String, is_correct:bool):
	var records = scores_in_topics[map_name][topic]
	records['answered'] += 1
	if is_correct:
		records['correct'] += 1

func load_policy(map_name:String, topic:String):
	return {
		'coast' : {
			'wind':'臺灣具備優良離岸風場資源，經濟部參考國際離岸風電發展趨勢，\n以三階段規劃離岸風電政策推動路徑：「先示範、次潛力、後區塊」，\n逐步建立我國離岸風電市場開發量能。\n\n全球離岸風電工程進度均受疫情影響，經濟部藉由跨部會合作降低影響，\n維持設置進度開發，截至2025年2月共有274座風力機併網，\n併網量超過3GW，全球排名第七，截至114年累積併網容量已突破 3GW ，\n經濟部已持續掌握各風場開發期程及辦理進度，\n並定期召開工作會議追蹤各案場的開發進度。\n\n離岸風電推動階段亦皆辦理多場社會溝通之公民參與機制，\n如於政策推動階段舉辦相關說明會及座談會、\n施工前辦理地方說明會等。經濟部持續不定期辦理社會溝通會議，\n建立與所有利害關係人對話及溝通機制，\n即時掌握面臨議題與困難，\n並共同研商解決方案，持續努力推動離岸風電政策。\n',
		},
		'west': {
			'solar':solar_policy
		},
		'east' : {
			'geothermal':geothermal_policy,
		}
	}[map_name][topic]



func load_topic_title_and_guide(map_name:String, topic:String):
	return {
		'coast' : {
			'wind':{
				'title':'離岸風電知多少!',
				'guide':'你體驗過新竹的大風嗎?\n如果你曾經被新竹的大風吹到站不穩而印象深刻\n那麼台灣海峽上空三倍速率的強風絕對會讓你更加驚嘆喔!'
			},},
		'west':{
			'solar':{
				'title':'太陽底下都可以成為發電廠!',
				'guide':'你知道當台灣遭遇颱風或地震，\n導致台電的供電線路暫時中斷時\n最能在偏遠的山區或鄉鎮內就近供電的設施是什麼嗎?'
			},},
		'east':{
			'geothermal':{
				'title':'來自地心的強大能量!',
				'guide':'你知道我們家裡平常只是用來煮一兩杯米的電鍋，\n已經是家裡耗能的最高的電器之一嗎?\n那麼能夠把整個地殼煮成岩漿的火山能量，\n如果能被用來發電，該是多強大的一股能源呢？'
			}
		}
	}[map_name][topic]
